; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-8-0)
(:domain BLOCKS)
(:objects B E A C D F G H - block pr2 - robot)
(:INIT (CLEAR A) (CLEAR D) (CLEAR B) (CLEAR C) (ONTABLE E) (ONTABLE F)
 (ONTABLE B) (ONTABLE C) (ON A G) (ON G E) (ON D H) (ON H F))
(:goal (AND (ON D F) (ON F E) (ON E H) (ON H C) (ON C A) (ON A G) (ON G B)))
)

; plan
1. (pick-up pr2 c)
   deleted: (ontable c) (clear c)
   added: (holding pr2 c)
   goals met: 1 of 7
2. (unstack pr2 a g)
   deleted: (clear a)
   added: (holding pr2 a) (clear g)
   goals met: 1 of 7
3. (put-down pr2 a)
   deleted: (holding pr2 a)
   added: (clear a) (ontable a)
   goals met: 1 of 7
4. (unstack pr2 g e)
   deleted: (clear g)
   added: (holding pr2 g) (clear e)
   goals met: 1 of 7
5. (stack pr2 g b)
   deleted: (holding pr2 g) (clear b)
   added: (clear g) (on g b)
   goals met: 2 of 7
6. (unstack pr2 d h)
   deleted: (clear d)
   added: (holding pr2 d) (clear h)
   goals met: 2 of 7
7. (stack pr2 c a)
   deleted: (holding pr2 c) (clear a)
   added: (clear c) (on c a)
   goals met: 3 of 7
8. (unstack pr2 h f)
   deleted: (clear h)
   added: (holding pr2 h) (clear f)
   goals met: 3 of 7
9. (stack pr2 h c)
   deleted: (holding pr2 h) (clear c)
   added: (clear h) (on h c)
   goals met: 4 of 7
10. (pick-up pr2 e)
   deleted: (ontable e) (clear e)
   added: (holding pr2 e)
   goals met: 4 of 7
11. (stack pr2 e h)
   deleted: (holding pr2 e) (clear h)
   added: (clear e) (on e h)
   goals met: 5 of 7
12. (pick-up pr2 f)
   deleted: (ontable f) (clear f)
   added: (holding pr2 f)
   goals met: 5 of 7
13. (stack pr2 f e)
   deleted: (holding pr2 f) (clear e)
   added: (clear f) (on f e)
   goals met: 6 of 7
14. (stack pr2 d f)
   deleted: (holding pr2 d) (clear f)
   added: (clear d) (on d f)
   goals met: 7 of 7
